GRID-Cos-Ray-Detection-Reasearch-Group/CosRay-Detector-Firmware/sdkconfig.defaults
#
# CosRay Muon Detector Firmware - sdkconfig.defaults
#
# This file contains the project-specific configuration overrides.
# Run `idf.py set-target esp32s3` and `idf.py build` to apply these settings.
# If sdkconfig does not exist, these defaults will be used to generate it.
#
# ESP32-S3 target
CONFIG_IDF_TARGET="esp32s3"

# =========================================================
# Bluetooth / NimBLE
# =========================================================
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y

CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=256
CONFIG_BT_NIMBLE_SVC_GAP_DEVICE_NAME="MuonDetector"
CONFIG_BT_NIMBLE_CRYPTO_STACK_MBEDTLS=y
CONFIG_BT_NIMBLE_USE_ESP_TIMER=y

# =========================================================
# ADC (suppress legacy API deprecation warnings)
# =========================================================
CONFIG_ADC_SUPPRESS_DEPRECATE_WARN=y
CONFIG_ADC_CALI_SUPPRESS_DEPRECATE_WARN=y

# =========================================================
# FreeRTOS (unicore mode, ESP32-S3 single-core profile)
# =========================================================
CONFIG_FREERTOS_UNICORE=y
CONFIG_FREERTOS_HZ=1000

# =========================================================
# NVS Flash (required by BLE bonding and system)
# =========================================================
CONFIG_NVS_ENCRYPTION=n

# =========================================================
# System / Logging
# =========================================================
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3
